zuorasoap/zuorasoap-connector/zuorasoap-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/zuorasoap/esbCreateMandatory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.zuora">
    <soapenv:Header/>
    <soapenv:Body>
        <urn:apiUrl>%s(apiUrl)</urn:apiUrl>
        <urn:username>%s(username)</urn:username>
        <urn:password>%s(password)</urn:password>
        <urn:method>create</urn:method>
        <urn1:zObjects xmlns:urn1="http://api.zuora.com/" type="Account">
            <urn1:zObject>
                <AccountNumber>%s(accountNumber)</AccountNumber>
                <AutoPay>false</AutoPay>
                <Batch>Batch1</Batch>
                <BillCycleDay>1</BillCycleDay>
                <Currency>USD</Currency>
                <Name>%s(name)</Name>
                <PaymentTerm>Due Upon Receipt</PaymentTerm>
                <Status>Draft</Status>
            </urn1:zObject>
        </urn1:zObjects>
    </soapenv:Body>
</soapenv:Envelope>